# Documentation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Schema..::..Documentation Property
Schema Class See Also
---
The overall description of the Schema.
**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public string Documentation { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Documentation As String
	Get
```

Visual C++
---
```text
public:
property String^ Documentation {
	String^ get ();
}
```

# See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace